* Core
** Tables
#+NAME: tab-workout
#+RESULTS: tab-workout-update
| Name    | Type                | Timed         | Weighted          |
|         | push/pull/legs/core | yes/no        | yes/no            |
|         |                     | Timed(s)/Reps | Weight(lb)/unused |
|---------+---------------------+---------------+-------------------|
| pullups | pull                | yes           | yes               |
| hi      | push                | yes           | no                |
| h       | b                   | c             | d                 |

#+NAME: tab-exercises
#+RESULTS: tab-exercises-update
| Name    | Type                | Timed         | Weighted          |
|         | push/pull/legs/core | yes/no        | yes/no            |
|         |                     | Timed(s)/Reps | Weight(lb)/unused |
|---------+---------------------+---------------+-------------------|
| pullups | pull                | yes           | yes               |
| pushups | push                | no            | yes               |
| scaps   | pull                | no            | no                |

** Interact
Want:
1. Org-capture build a table of the workout that it places under header.
2. Want there to be a small text representation of the workout for header.

Todo:
1. Prompt for sets, and ask if adding more workouts.
2. Possibly pull from multiple tables at once (workout can be composed of cardio
   and strength and mobility rather than split capturing each time)
3. remove the unused, account for no alternative/unbalanced prompts/options

#+NAME: interact
#+begin_src emacs-lisp :var exercises=tab-exercises :colnames no :hlines yes
; (health--parse-tables)
; (health--add-to-table)
(health--prompt-from-table)
#+end_src

#+RESULTS: interact
| 2 | 3 |



Test format for capturing
| Name    | Type                | Timed         | Weighted          |
|         | push/pull/legs/core | yes/no        | yes/no            |
|         |                     | Timed(s)/Reps | Weight(lb)/unused |
|---------+---------------------+---------------+-------------------|
| pullups | pull                | yes           | yes               |
| pushups | push                | no            | yes               |
| scaps   | pull                | no            | no                |
| r       | push                | yes           | yes               |
